[    
    {
      "exercise_name": "Push-up",
      "description": "The push-up is a classic bodyweight exercise where you lower and raise your body using your arms, targeting the chest, triceps, and shoulders.",
      "equipment": "None",
      "calories_burned_per_rep": 0.89,
      "muscle_groups": ["Chest", "Triceps", "Shoulders"]
    },
    {
      "exercise_name": "Sit-up",
      "description": "Sit-ups are abdominal exercises where you lie on your back, bend your knees, and lift your upper body toward your knees, targeting the abdominal muscles.",
      "equipment": "None",
      "calories_burned_per_rep": 0.53,
      "muscle_groups": ["Abdominals"]
    },
    {
      "exercise_name": "Squat",
      "description": "Squats are compound exercises where you bend your knees and hips to lower your body, then return to a standing position, targeting the quadriceps, hamstrings, and glutes.",
      "equipment": "None",
      "calories_burned_per_rep": 0.92,
      "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
      "exercise_name": "Lunges",
      "description": "Lunges are exercises where you step forward with one leg and lower your body until both knees are bent at a 90-degree angle, targeting the quadriceps, hamstrings, and glutes.",
      "equipment": "None",
      "calories_burned_per_rep": 0.57,
      "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
      "exercise_name": "Plank",
      "description": "The plank is a core exercise where you hold your body in a straight line, supported by your forearms and toes, targeting the core muscles, shoulders, and arms.",
      "equipment": "None",
      "calories_burned_per_rep": 0.29,
      "muscle_groups": ["Core", "Shoulders", "Arms"]
    },
    {
      "exercise_name": "Jumping jacks",
      "description": "Jumping jacks are a cardiovascular exercise where you jump with your legs spread wide and your hands touching overhead, then return to the starting position.",
      "equipment": "None",
      "calories_burned_per_rep": 0.1,
      "muscle_groups": ["Full body"]
    },
    {
      "exercise_name": "Mountain climbers",
      "description": "Mountain climbers are dynamic exercises where you start in a plank position and alternate bringing your knees toward your chest, targeting the core, shoulders, and legs.",
      "equipment": "None",
      "calories_burned_per_rep": 0.29,
      "muscle_groups": ["Core", "Shoulders", "Legs"]
    },
    {
      "exercise_name": "Burpees",
      "description": "Burpees are full-body exercises where you start in a standing position, drop into a squat, kick your feet back to a plank, return to the squat position, and jump up.",
      "equipment": "None",
      "calories_burned_per_rep": 1.42,
      "muscle_groups": ["Full body"]
    },
    {
      "exercise_name": "High knees",
      "description": "High knees are cardiovascular exercises where you jog in place, lifting your knees as high as possible, targeting the legs and providing a good cardio workout.",
      "equipment": "None",
      "calories_burned_per_rep": 0.13,
      "muscle_groups": ["Legs", "Cardio"]
    },
    {
      "exercise_name": "Bicycle crunches",
      "description": "Bicycle crunches are abdominal exercises where you lie on your back, bring one knee toward your chest while rotating your torso, and touch your opposite elbow to the knee.",
      "equipment": "None",
      "calories_burned_per_rep": 0.14,
      "muscle_groups": ["Abdominals", "Obliques"]
    },
    {
      "exercise_name": "Russian twists",
      "description": "Russian twists are rotational exercises where you sit on the floor, lean back slightly, lift your feet off the ground, and twist your torso from side to side while holding a weight or medicine ball.",
      "equipment": "Weight or medicine ball",
      "calories_burned_per_rep": 0.12,
      "muscle_groups": ["Abdominals", "Obliques"]
    },
    {
      "exercise_name": "Tricep dips",
      "description": "Tricep dips are exercises where you position your hands behind you on a bench or chair, lower your body, and then push back up, targeting the triceps, chest, and shoulders.",
      "equipment": "Bench or chair",
      "calories_burned_per_rep": 0.26,
      "muscle_groups": ["Triceps", "Chest", "Shoulders"]
    },
    {
      "exercise_name": "Wall sit",
      "description": "The wall sit is a static exercise where you slide your back down a wall and lower your body into a seated position, maintaining the position for a specific duration, targeting the quadriceps and glutes.",
      "equipment": "Wall",
      "calories_burned_per_rep": 0.29,
      "muscle_groups": ["Quadriceps", "Glutes"]
    },
    {
      "exercise_name": "Deadlifts",
      "description": "Deadlifts are compound exercises where you lift a weighted barbell or dumbbells from the floor, targeting the hamstrings, glutes, and lower back.",
      "equipment": "Barbell or dumbbells",
      "calories_burned_per_rep": 1.03,
      "muscle_groups": ["Hamstrings", "Glutes", "Lower Back"]
    },
    {
      "exercise_name": "Bicep curls",
      "description": "Bicep curls are isolation exercises where you hold dumbbells or a barbell with an underhand grip and curl the weight toward your shoulders, targeting the biceps.",
      "equipment": "Dumbbells or barbell",
      "calories_burned_per_rep": 0.19,
      "muscle_groups": ["Biceps"]
    },
    {
      "exercise_name": "Shoulder press",
      "description": "Shoulder presses are compound exercises where you lift dumbbells or a barbell from shoulder height to an overhead position, targeting the shoulders and triceps.",
      "equipment": "Dumbbells or barbell",
      "calories_burned_per_rep": 0.35,
      "muscle_groups": ["Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Side plank",
      "description": "The side plank is a variation of the plank exercise where you support your body on one forearm and the side of your foot, targeting the obliques and core muscles.",
      "equipment": "None",
      "calories_burned_per_rep": 0.24,
      "muscle_groups": ["Obliques", "Core"]
    },
    {
      "exercise_name": "Calf raises",
      "description": "Calf raises are exercises where you rise up onto the balls of your feet, targeting the calf muscles.",
      "equipment": "None",
      "calories_burned_per_rep": 0.16,
      "muscle_groups": ["Calves"]
    },
    {
      "exercise_name": "Leg press",
      "description": "The leg press is a machine-based exercise where you sit on a platform and push the weighted platform away from your body using your legs, targeting the quadriceps, hamstrings, and glutes.",
      "equipment": "Leg press machine",
      "calories_burned_per_rep": 0.73,
      "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
      "exercise_name": "Leg curls",
      "description": "Leg curls are exercises where you lie face down on a leg curl machine and curl your legs up toward your glutes, targeting the hamstrings.",
      "equipment": "Leg curl machine",
      "calories_burned_per_rep": 0.39,
      "muscle_groups": ["Hamstrings"]
    },
    {
      "exercise_name": "Leg extensions",
      "description": "Leg extensions are exercises where you sit on a leg extension machine and extend your legs to lift a weighted pad, targeting the quadriceps.",
      "equipment": "Leg extension machine",
      "calories_burned_per_rep": 0.3,
      "muscle_groups": ["Quadriceps"]
    },
    {
      "exercise_name": "Seated rows",
      "description": "Seated rows are exercises where you sit on a rowing machine, grasp the handles, and pull them toward your body, targeting the back and biceps.",
      "equipment": "Rowing machine",
      "calories_burned_per_rep": 0.35,
      "muscle_groups": ["Back", "Biceps"]
    },
    {
      "exercise_name": "Lat pulldowns",
      "description": "Lat pulldowns are exercises where you sit at a lat pulldown machine, grasp the bar with an overhand grip, and pull it down toward your chest, targeting the back and biceps.",
      "equipment": "Lat pulldown machine",
      "calories_burned_per_rep": 0.35,
      "muscle_groups": ["Back", "Biceps"]
    },
    {
      "exercise_name": "Chest press",
      "description": "The chest press is an exercise where you lie on a bench or sit on a chest press machine and press the weighted bar or handles away from your body, targeting the chest, shoulders, and triceps.",
      "equipment": "Bench or chest press machine",
      "calories_burned_per_rep": 0.38,
      "muscle_groups": ["Chest", "Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Shoulder raises",
      "description": "Shoulder raises are exercises where you hold dumbbells or a barbell and raise your arms to the side or front, targeting the shoulders.",
      "equipment": "Dumbbells or barbell",
      "calories_burned_per_rep": 0.2,
      "muscle_groups": ["Shoulders"]
    },
    {
      "exercise_name": "Step-ups",
      "description": "Step-ups are exercises where you step onto a raised platform or bench with one foot and then bring the other foot up, targeting the quadriceps, glutes, and hamstrings.",
      "equipment": "Raised platform or bench",
      "calories_burned_per_rep": 0.39,
      "muscle_groups": ["Quadriceps", "Glutes", "Hamstrings"]
    },
    {
      "exercise_name": "Flutter kicks",
      "description": "Flutter kicks are abdominal exercises where you lie on your back, keep your legs straight, and alternate lifting each leg a few inches off the ground in a fluttering motion.",
      "equipment": "None",
      "calories_burned_per_rep": 0.08,
      "muscle_groups": ["Lower Abs", "Hip Flexors"]
    },
    {
      "exercise_name": "Superman",
      "description": "The superman exercise is a back exercise where you lie face down on the ground, lift your arms and legs off the ground simultaneously, and hold the position briefly.",
      "equipment": "None",
      "calories_burned_per_rep": 0.15,
      "muscle_groups": ["Lower Back", "Glutes"]
    },
    {
      "exercise_name": "Glute bridges",
      "description": "Glute bridges are exercises where you lie on your back, bend your knees, lift your hips off the ground, and squeeze your glutes at the top of the movement.",
      "equipment": "None",
      "calories_burned_per_rep": 0.18,
      "muscle_groups": ["Glutes", "Hamstrings"]
    },
    {
      "exercise_name": "Box jumps",
      "description": "Box jumps are explosive exercises where you jump onto a raised platform, step back down, and repeat, targeting the legs and providing a cardio workout.",
      "equipment": "Raised platform or box",
      "calories_burned_per_rep": 0.3,
      "muscle_groups": ["Legs", "Explosive Power"]
    },
    {
      "exercise_name": "Jump rope",
      "description": "Jumping rope is a cardiovascular exercise where you jump over a rope swung beneath your feet, targeting the whole body and providing a good cardio workout.",
      "equipment": "Jump rope",
      "calories_burned_per_rep": 0.12,
      "muscle_groups": ["Cardio", "Full body"]
    },
    {
      "exercise_name": "Bench press",
      "description": "The bench press is a compound exercise where you lie on a bench and press a weighted barbell or dumbbells upward, targeting the chest, shoulders, and triceps.",
      "equipment": "Bench and barbell or dumbbells",
      "calories_burned_per_rep": 0.55,
      "muscle_groups": ["Chest", "Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Dumbbell flyes",
      "description": "Dumbbell flyes are exercises where you lie on a bench, hold dumbbells with your arms extended to the sides, and bring the weights together in front of your chest, targeting the chest muscles.",
      "equipment": "Bench and dumbbells",
      "calories_burned_per_rep": 0.25,
      "muscle_groups": ["Chest"]
    },
    {
      "exercise_name": "Hammer curls",
      "description": "Hammer curls are bicep exercises where you hold dumbbells with your palms facing your body and curl the weights toward your shoulders, targeting the biceps and forearms.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.19,
      "muscle_groups": ["Biceps", "Forearms"]
    },
    {
      "exercise_name": "Skull crushers",
      "description": "Skull crushers, also known as lying tricep extensions, are exercises where you lie on a bench, hold a barbell or dumbbells above your head, and lower the weight toward your forehead, targeting the triceps.",
      "equipment": "Bench and barbell or dumbbells",
      "calories_burned_per_rep": 0.25,
      "muscle_groups": ["Triceps"]
    },
    {
      "exercise_name": "Front raises",
      "description": "Front raises are exercises where you hold dumbbells and raise your arms forward and upward until they are parallel to the ground, targeting the front deltoids.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.16,
      "muscle_groups": ["Shoulders"]
    },
    {
      "exercise_name": "Renegade rows",
      "description": "Renegade rows are compound exercises where you start in a plank position with dumbbells in your hands, row one arm up while stabilizing with the other, targeting the back, shoulders, and core.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.28,
      "muscle_groups": ["Back", "Shoulders", "Core"]
    },
    {
      "exercise_name": "Barbell squats",
      "description": "Barbell squats are compound exercises where you place a barbell on your upper back, lower your body into a squat position, and then return to a standing position, targeting the quadriceps, hamstrings, and glutes.",
      "equipment": "Barbell",
      "calories_burned_per_rep": 0.92,
      "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
      "exercise_name": "Dumbbell lunges",
      "description": "Dumbbell lunges are exercises where you hold dumbbells in each hand, step forward with one leg, lower your body until both knees are bent, and then return to the starting position, targeting the quadriceps, hamstrings, and glutes.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.57,
      "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
      "exercise_name": "Dumbbell bench press",
      "description": "The dumbbell bench press is a variation of the bench press where you lie on a bench and press dumbbells upward instead of using a barbell, targeting the chest, shoulders, and triceps.",
      "equipment": "Bench and dumbbells",
      "calories_burned_per_rep": 0.38,
      "muscle_groups": ["Chest", "Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Overhead press",
      "description": "The overhead press, also known as the military press, is a compound exercise where you press a barbell or dumbbells overhead from shoulder height, targeting the shoulders and triceps.",
      "equipment": "Barbell or dumbbells",
      "calories_burned_per_rep": 0.35,
      "muscle_groups": ["Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Reverse flyes",
      "description": "Reverse flyes are exercises where you bend forward at the waist with a slight bend in your knees, hold dumbbells with your palms facing each other, and raise the weights to the sides until your arms are parallel to the ground, targeting the rear deltoids.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.16,
      "muscle_groups": ["Shoulders"]
    },
    {
      "exercise_name": "Dumbbell pullovers",
      "description": "Dumbbell pullovers are exercises where you lie on a bench, hold a dumbbell overhead, and lower the weight behind your head until your arms are parallel to the ground, targeting the chest, back, and triceps.",
      "equipment": "Bench and dumbbell",
      "calories_burned_per_rep": 0.25,
      "muscle_groups": ["Chest", "Back", "Triceps"]
    },
    {
      "exercise_name": "Arnold presses",
      "description": "Arnold presses are compound exercises where you start with the dumbbells in a neutral grip at shoulder level, press the weights overhead while rotating your wrists, and return to the starting position, targeting the shoulders and triceps.",
      "equipment": "Dumbbells",
      "calories_burned_per_rep": 0.35,
      "muscle_groups": ["Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Side plank with leg lift",
      "description": "The side plank with leg lift is a variation of the side plank exercise where you support your body on one forearm and the side of your foot, and then lift the top leg upward while maintaining balance, targeting the obliques, core, and hip abductors.",
      "equipment": "None",
      "calories_burned_per_rep": 0.26,
      "muscle_groups": ["Obliques", "Core", "Hip Abductors"]
    },
    {
      "exercise_name": "Seated calf raises",
      "description": "Seated calf raises are exercises where you sit on a calf raise machine or use a bench to support your thighs, and then lift your heels off the ground by contracting your calves, targeting the calves.",
      "equipment": "Calf raise machine or bench",
      "calories_burned_per_rep": 0.16,
      "muscle_groups": ["Calves"]
    },
    {
      "exercise_name": "Incline bench press",
      "description": "The incline bench press is a variation of the bench press where you lie on an incline bench and press a weighted barbell or dumbbells upward, targeting the upper chest, shoulders, and triceps.",
      "equipment": "Incline bench and barbell or dumbbells",
      "calories_burned_per_rep": 0.55,
      "muscle_groups": ["Upper Chest", "Shoulders", "Triceps"]
    },
    {
      "exercise_name": "Lateral lunges",
      "description": "Lateral lunges, also known as side lunges, are exercises where you step to the side with one leg, bend that knee while keeping the other leg straight, and then return to the starting position, targeting the inner and outer thighs, quadriceps, and glutes.",
      "equipment": "None",
      "calories_burned_per_rep": 0.34,
      "muscle_groups": ["Quadriceps", "Glutes", "Inner Thighs", "Outer Thighs"]
    },
    {
      "exercise_name": "Bicep curls",
      "description": "Bicep curls are exercises where you hold dumbbells or a barbell with an underhand grip and curl the weights toward your shoulders, targeting the biceps.",
      "equipment": "Dumbbells or barbell",
      "calories_burned_per_rep": 0.19,
      "muscle_groups": ["Biceps"]
    },
    {
      "exercise_name": "Tricep dips",
      "description": "Tricep dips are exercises where you position your hands on a bench or parallel bars behind you, extend your legs forward, and lower your body by bending your elbows, targeting the triceps.",
      "equipment": "Bench or parallel bars",
      "calories_burned_per_rep": 0.28,
      "muscle_groups": ["Triceps"]
    },
    {
      "exercise_name": "Upright rows",
      "description": "Upright rows are exercises where you hold a barbell or dumbbells in front of your thighs, pull the weight upward toward your chin, and then lower it back down, targeting the shoulders and upper back.",
      "equipment": "Barbell or dumbbells",
      "calories_burned_per_rep": 0.25,
      "muscle_groups": ["Shoulders", "Upper Back"]
    },
    {
      "exercise_name": "Russian twists",
      "description": "Russian twists are abdominal exercises where you sit on the ground with your knees bent, lean back slightly, hold a weight or medicine ball, and rotate your torso from side to side, targeting the obliques and core.",
      "equipment": "Weight or medicine ball",
      "calories_burned_per_rep": 0.13,
      "muscle_groups": ["Obliques", "Core"]
    },
    {
      "exercise_name": "Hip thrusts",
      "description": "Hip thrusts are exercises where you sit on the ground with your back against a bench, place a barbell or dumbbells over your hips, and thrust your hips upward, targeting the glutes and hamstrings.",
      "equipment": "Barbell or dumbbells",
      "calories_burned_per_rep": 0.27,
      "muscle_groups": ["Glutes", "Hamstrings"]
    },
    {
      "exercise_name": "Burpees",
      "description": "Burpees are full-body exercises where you start in a standing position, drop into a squat, kick your feet back into a push-up position, perform a push-up, jump your feet back to the squat position, and then jump explosively into the air, targeting the whole body and providing a cardio workout.",
      "equipment": "None",
      "calories_burned_per_rep": 0.45,
      "muscle_groups": ["Full body", "Cardio"]
    },
    {
      "exercise_name": "Mountain climbers",
      "description": "Mountain climbers are dynamic exercises where you start in a push-up position and alternate bringing your knees toward your chest in a running motion, targeting the core, shoulders, and legs while providing a cardio workout.",
      "equipment": "None",
      "calories_burned_per_rep": 0.2,
      "muscle_groups": ["Core", "Shoulders", "Legs", "Cardio"]
    },
    {
      "exercise_name": "Deadlifts",
      "description": "Deadlifts are compound exercises where you lift a barbell or dumbbells from the ground, standing up with the weight, and then lower it back down, targeting the legs, back, and core.",
      "equipment": "Barbell or dumbbells",
      "calories_burned_per_rep": 0.46,
      "muscle_groups": ["Legs", "Back", "Core"]
    },
    {
      "exercise_name": "Plank",
      "description": "The plank is a core exercise where you support your body on your forearms and toes, maintaining a straight line from head to heels, targeting the core muscles.",
      "equipment": "None",
      "calories_burned_per_rep": 0.04,
      "muscle_groups": ["Core"]
    },
    {
      "exercise_name": "Calf raises",
      "description": "Calf raises are exercises where you stand with your feet shoulder-width apart, rise up onto your toes, and then lower your heels back down, targeting the calves.",
      "equipment": "None",
      "calories_burned_per_rep": 0.09,
      "muscle_groups": ["Calves"]
    },
    {
        "exercise_name": "Plank shoulder taps",
        "description": "Plank shoulder taps are performed in a plank position, and involve tapping one hand to the opposite shoulder while maintaining stability, targeting the core and shoulders.",
        "equipment": "None",
        "calories_burned_per_rep": 0.05,
        "muscle_groups": ["Core", "Shoulders"]
    },
    {
        "exercise_name": "Side plank",
        "description": "Side planks are performed by balancing on one forearm and the side of the foot, engaging the core muscles and obliques.",
        "equipment": "None",
        "calories_burned_per_rep": 0.06,
        "muscle_groups": ["Core", "Obliques"]
    },
    {
        "exercise_name": "Jumping lunges",
        "description": "Jumping lunges are explosive exercises that involve lunging forward and switching legs in mid-air, targeting the quadriceps, hamstrings, and glutes.",
        "equipment": "None",
        "calories_burned_per_rep": 0.18,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Bicycle crunches",
        "description": "Bicycle crunches are performed by lying on your back, bringing your knees toward your chest, and alternately touching your elbows to opposite knees in a pedaling motion, targeting the core and obliques.",
        "equipment": "None",
        "calories_burned_per_rep": 0.07,
        "muscle_groups": ["Core", "Obliques"]
    },
    {
        "exercise_name": "Leg press",
        "description": "Leg presses are performed using a leg press machine, where you push against a weighted platform with your feet, targeting the quadriceps, hamstrings, and glutes.",
        "equipment": "Leg press machine",
        "calories_burned_per_rep": 0.54,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Incline dumbbell bench press",
        "description": "The incline dumbbell bench press is similar to the incline bench press but performed with dumbbells, targeting the upper chest, shoulders, and triceps.",
        "equipment": "Incline bench and dumbbells",
        "calories_burned_per_rep": 0.38,
        "muscle_groups": ["Upper Chest", "Shoulders", "Triceps"]
    },
    {
        "exercise_name": "Cable curls",
        "description": "Cable curls are performed using a cable machine and a curl bar or handles, targeting the biceps.",
        "equipment": "Cable machine and curl bar or handles",
        "calories_burned_per_rep": 0.12,
        "muscle_groups": ["Biceps"]
    },
    {
        "exercise_name": "Tricep pushdowns",
        "description": "Tricep pushdowns are performed using a cable machine and a straight bar or rope attachment, targeting the triceps.",
        "equipment": "Cable machine and straight bar or rope attachment",
        "calories_burned_per_rep": 0.12,
        "muscle_groups": ["Triceps"]
    },
    {
        "exercise_name": "Reverse lunges",
        "description": "Reverse lunges are performed by stepping backward into a lunge position, targeting the quadriceps, hamstrings, and glutes.",
        "equipment": "None",
        "calories_burned_per_rep": 0.14,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Romanian deadlifts",
        "description": "Romanian deadlifts are performed by holding a barbell or dumbbells with a slight bend in the knees, hinging at the hips to lower the weights toward the ground while keeping your back straight, targeting the hamstrings and glutes.",
        "equipment": "Barbell or dumbbells",
        "calories_burned_per_rep": 0.31,
        "muscle_groups": ["Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Step-ups",
        "description": "Step-ups are performed by stepping onto a raised platform with one foot, driving through the heel to lift the body upward, and then stepping back down, targeting the quadriceps, hamstrings, and glutes.",
        "equipment": "Raised platform",
        "calories_burned_per_rep": 0.15,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Decline bench press",
        "description": "The decline bench press is a variation of the bench press where you lie on a decline bench and press a weighted barbell or dumbbells upward, targeting the lower chest, shoulders, and triceps.",
        "equipment": "Decline bench and barbell or dumbbells",
        "calories_burned_per_rep": 0.52,
        "muscle_groups": ["Lower Chest", "Shoulders", "Triceps"]
    },
    {
        "exercise_name": "Hamstring curls",
        "description": "Hamstring curls are performed using a hamstring curl machine or resistance bands, where you flex your knees to curl the weight or resistance toward your glutes, targeting the hamstrings.",
        "equipment": "Hamstring curl machine or resistance bands",
        "calories_burned_per_rep": 0.13,
        "muscle_groups": ["Hamstrings"]
    },
    {
        "exercise_name": "Seated rows",
        "description": "Seated rows are performed using a cable machine and a seated row handle, where you sit with your legs extended, pull the cable toward your body, and squeeze your shoulder blades together, targeting the back and biceps.",
        "equipment": "Cable machine and seated row handle",
        "calories_burned_per_rep": 0.19,
        "muscle_groups": ["Back", "Biceps"]
    },
    {
        "exercise_name": "Medicine ball slams",
        "description": "Medicine ball slams involve lifting a medicine ball overhead and forcefully slamming it down to the ground, targeting the core and providing a high-intensity cardio workout.",
        "equipment": "Medicine ball",
        "calories_burned_per_rep": 0.28,
        "muscle_groups": ["Core", "Cardio"]
    },
    {
        "exercise_name": "Jump squats",
        "description": "Jump squats are explosive exercises that involve squatting down and then jumping explosively into the air, targeting the quadriceps, hamstrings, glutes, and providing a cardio workout.",
        "equipment": "None",
        "calories_burned_per_rep": 0.2,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes", "Cardio"]
    },
    {
        "exercise_name": "Lateral raises",
        "description": "Lateral raises are performed by holding dumbbells at your sides and lifting them out to the sides until your arms are parallel to the ground, targeting the shoulders.",
        "equipment": "Dumbbells",
        "calories_burned_per_rep": 0.07,
        "muscle_groups": ["Shoulders"]
    },
    {
        "exercise_name": "Cable woodchops",
        "description": "Cable woodchops are performed using a cable machine and a handle or rope attachment, where you rotate your torso diagonally while pulling the cable across your body, targeting the core and obliques.",
        "equipment": "Cable machine and handle or rope attachment",
        "calories_burned_per_rep": 0.11,
        "muscle_groups": ["Core", "Obliques"]
    },
    {
        "exercise_name": "Side lateral raises",
        "description": "Side lateral raises are performed by holding dumbbells at your sides and lifting them out to the sides until your arms are parallel to the ground, targeting the side delts and shoulders.",
        "equipment": "Dumbbells",
        "calories_burned_per_rep": 0.07,
        "muscle_groups": ["Side Delts", "Shoulders"]
    },
    {
        "exercise_name": "Seated calf raises",
        "description": "Seated calf raises are performed using a seated calf raise machine or a weight plate resting on your thighs, where you raise your heels by extending your ankles, targeting the calves.",
        "equipment": "Seated calf raise machine or weight plate",
        "calories_burned_per_rep": 0.09,
        "muscle_groups": ["Calves"]
    },
    {
        "exercise_name": "Lying leg curls",
        "description": "Lying leg curls are performed using a leg curl machine, where you lie face down and curl the weight toward your glutes by flexing your knees, targeting the hamstrings.",
        "equipment": "Leg curl machine",
        "calories_burned_per_rep": 0.14,
        "muscle_groups": ["Hamstrings"]
    },
    {
        "exercise_name": "Seated dumbbell shoulder press",
        "description": "Seated dumbbell shoulder presses are performed by sitting on a bench and pressing dumbbells upward until your arms are fully extended, targeting the shoulders and triceps.",
        "equipment": "Bench and dumbbells",
        "calories_burned_per_rep": 0.2,
        "muscle_groups": ["Shoulders", "Triceps"]
    },
    {
        "exercise_name": "Barbell hip thrusts",
        "description": "Barbell hip thrusts are performed by sitting on the ground with your back against a bench, placing a barbell over your hips, and thrusting your hips upward until your body forms a straight line, targeting the glutes and hamstrings.",
        "equipment": "Barbell",
        "calories_burned_per_rep": 0.27,
        "muscle_groups": ["Glutes", "Hamstrings"]
    },
    {
        "exercise_name": "Kettlebell swings",
        "description": "Kettlebell swings are explosive exercises where you swing a kettlebell between your legs and then drive your hips forward to swing the kettlebell up to shoulder level, targeting the glutes, hamstrings, and providing a cardio workout.",
        "equipment": "Kettlebell",
        "calories_burned_per_rep": 0.27,
        "muscle_groups": ["Glutes", "Hamstrings", "Cardio"]
    },
    {
        "exercise_name": "Single-leg deadlifts",
        "description": "Single-leg deadlifts are performed by standing on one leg, bending at the hips while keeping your back straight, and lowering a dumbbell or kettlebell toward the ground, targeting the hamstrings and glutes.",
        "equipment": "Dumbbell or kettlebell",
        "calories_burned_per_rep": 0.25,
        "muscle_groups": ["Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Seated cable rows",
        "description": "Seated cable rows are performed using a cable machine and a seated row handle, where you sit with your knees slightly bent, pull the cable toward your body, and squeeze your shoulder blades together, targeting the back and biceps.",
        "equipment": "Cable machine and seated row handle",
        "calories_burned_per_rep": 0.19,
        "muscle_groups": ["Back", "Biceps"]
    },
    {
        "exercise_name": "Russian twists",
        "description": "Russian twists are performed by sitting on the ground, leaning back slightly, and rotating your torso from side to side while holding a weight or medicine ball, targeting the core and obliques.",
        "equipment": "Weight or medicine ball",
        "calories_burned_per_rep": 0.06,
        "muscle_groups": ["Core", "Obliques"]
    },
    {
        "exercise_name": "Mountain climbers",
        "description": "Mountain climbers are performed by starting in a push-up position and alternately bringing your knees toward your chest in a running motion, targeting the core and providing a cardio workout.",
        "equipment": "None",
        "calories_burned_per_rep": 0.1,
        "muscle_groups": ["Core", "Cardio"]
    },
    {
        "exercise_name": "Burpees",
        "description": "Burpees are full-body exercises where you start in a standing position, drop into a push-up position, perform a push-up, jump your feet forward, and then jump explosively into the air, targeting multiple muscle groups and providing a cardio workout.",
        "equipment": "None",
        "calories_burned_per_rep": 0.14,
        "muscle_groups": ["Full Body", "Cardio"]
    },
    {
        "exercise_name": "Box jumps",
        "description": "Box jumps are explosive exercises where you jump onto a raised platform, step down, and repeat, targeting the lower body and providing a cardio workout.",
        "equipment": "Raised platform",
        "calories_burned_per_rep": 0.2,
        "muscle_groups": ["Legs", "Glutes", "Cardio"]
    },
    {
        "exercise_name": "Dips",
        "description": "Dips are performed on parallel bars or dip stations, where you lower your body by bending your arms and then push yourself back up, targeting the chest, triceps, and shoulders.",
        "equipment": "Parallel bars or dip station",
        "calories_burned_per_rep": 0.16,
        "muscle_groups": ["Chest", "Triceps", "Shoulders"]
    },
    {
        "exercise_name": "Plank variations",
        "description": "Plank variations include exercises such as plank jacks, plank twists, and plank reaches, which add variety and challenge to the basic plank exercise while targeting the core and other muscle groups.",
        "equipment": "None",
        "calories_burned_per_rep": 0.06,
        "muscle_groups": ["Core", "Full Body"]
    },
    {
        "exercise_name": "Barbell bent-over rows",
        "description": "Barbell bent-over rows are performed by bending forward at the hips with a slight bend in the knees, holding a barbell with an overhand grip, and pulling the barbell toward your lower chest while keeping your back straight, targeting the back and biceps.",
        "equipment": "Barbell",
        "calories_burned_per_rep": 0.23,
        "muscle_groups": ["Back", "Biceps"]
    },
    {
        "exercise_name": "Hanging leg raises",
        "description": "Hanging leg raises are performed by hanging from a pull-up bar or dip station and lifting your legs until they are parallel to the ground or higher, targeting the core and hip flexors.",
        "equipment": "Pull-up bar or dip station",
        "calories_burned_per_rep": 0.1,
        "muscle_groups": ["Core", "Hip Flexors"]
    },
    {
        "exercise_name": "Wide grip pull-ups",
        "description": "Wide grip pull-ups are performed on a pull-up bar with your hands placed wider than shoulder-width apart, targeting the back and biceps.",
        "equipment": "Pull-up bar",
        "calories_burned_per_rep": 0.12,
        "muscle_groups": ["Back", "Biceps"]
    },
    {
        "exercise_name": "Diamond push-ups",
        "description": "Diamond push-ups are performed in a push-up position with your hands close together in a diamond shape, targeting the triceps and chest.",
        "equipment": "None",
        "calories_burned_per_rep": 0.08,
        "muscle_groups": ["Triceps", "Chest"]
    },
    {
        "exercise_name": "Single-arm dumbbell rows",
        "description": "Single-arm dumbbell rows are performed by placing one hand and one knee on a bench, holding a dumbbell in the opposite hand, and rowing the dumbbell toward your hip, targeting the back and biceps.",
        "equipment": "Bench and dumbbell",
        "calories_burned_per_rep": 0.19,
        "muscle_groups": ["Back", "Biceps"]
    },
    {
        "exercise_name": "Side plank hip dips",
        "description": "Side plank hip dips are performed in a side plank position, and involve lowering your hip toward the ground and then lifting it back up, targeting the core and obliques.",
        "equipment": "None",
        "calories_burned_per_rep": 0.06,
        "muscle_groups": ["Core", "Obliques"]
    },
    {
        "exercise_name": "Barbell front squats",
        "description": "Barbell front squats are performed by resting a barbell on the front of your shoulders, crossing your arms to hold the barbell in place, and squatting down, targeting the quadriceps, hamstrings, and glutes.",
        "equipment": "Barbell",
        "calories_burned_per_rep": 0.27,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    },
    {
        "exercise_name": "Close grip bench press",
        "description": "The close grip bench press is a variation of the bench press where you place your hands closer together on the barbell, targeting the triceps, chest, and shoulders.",
        "equipment": "Barbell",
        "calories_burned_per_rep": 0.29,
        "muscle_groups": ["Triceps", "Chest", "Shoulders"]
    },
    {
        "exercise_name": "Barbell bicep curls",
        "description": "Barbell bicep curls are performed by holding a barbell with an underhand grip, curling the barbell upward, and then lowering it back down, targeting the biceps.",
        "equipment": "Barbell",
        "calories_burned_per_rep": 0.1,
        "muscle_groups": ["Biceps"]
    },
    {
        "exercise_name": "Pistol squats",
        "description": "Pistol squats, also known as single-leg squats, are performed by balancing on one leg while extending the other leg forward. With your arms extended in front of you, you lower your body by bending the standing leg, keeping the other leg straight, and then return to the starting position. This exercise targets the quadriceps, hamstrings, glutes, and requires balance and stability.",
        "equipment": "None",
        "calories_burned_per_rep": 0.15,
        "muscle_groups": ["Quadriceps", "Hamstrings", "Glutes"]
    }
]
          